In [3]:
import numpy as np
import pandas as pd
populationValues = [10000,12000,15000,20000]
schoolValues = [7500,7800,6600,8000]
HospitalValues = [1500,2000,1800,1700]

dict1 = {'Population':populationValues,'Hospitals':HospitalValues,"Schools":schoolValues}
cities = ['Lahore','Karachi','Islamabad','Quetta']
df5 = pd.DataFrame(dict1,index=cities)
df5

           Population  Hospitals  Schools
Lahore          10000       1500     7500
Karachi         12000       2000     7800
Islamabad       15000       1800     6600
Quetta          20000       1700     8000

In [6]:
df5[['Population','Schools']] # accessing multiple columns of a data frame

           Population  Schools
Lahore          10000     7500
Karachi         12000     7800
Islamabad       15000     6600
Quetta          20000     8000

In [7]:
# accessing rows/columns 
df5.loc['Karachi':,:] #Karachi se shuru kr k last tk rows lo aur  columns bhi saaray lao.

           Population  Hospitals  Schools
Karachi         12000       2000     7800
Islamabad       15000       1800     6600
Quetta          20000       1700     8000

In [8]:
df5.loc['Islamabad',:] #without colon den tou mehiz aik shehar(aik row k against columns) ki details aajayengi.

Population    15000
Hospitals      1800
Schools        6600
Name: Islamabad, dtype: int64

In [9]:
df5.loc['Lahore':'Karachi','Population':'Hospitals']

         Population  Hospitals
Lahore        10000       1500
Karachi       12000       2000

In [10]:
df5.loc['Lahore':'Karachi','Population'] # is trhh kisi bhi trh dataFrame k data ko accesss kia jaskta hai through loc function.

Lahore     10000
Karachi    12000
Name: Population, dtype: int64

In [11]:
df5.iloc[0:2,0:2] #iloc function indexing k through access krne k case main use hoga yaad rahe k last index row aur column dono main hi excluded hoga yahan.

         Population  Hospitals
Lahore        10000       1500
Karachi       12000       2000

In [13]:
df5.iloc[2,2] #Islamabad k Schools access kiay hain isne!

6600